// 每个州的容器
var AItem = document.querySelector('.place .A');

const AArr = [
   ['直辖市','北京','上海','重庆','天津'],
   ['云南','丽江','大理','昆明','香格里拉','泸沽湖','双廊','西双版纳','束河','腾冲','雨崩'],
   ['四川','成都','九寨沟','稻城','色达','若尔盖','都江堰','亚丁','阿坝','峨眉山','牛背山'],
   ['浙江','杭州','乌镇','西塘','千岛湖','普陀山','东极岛'],
   ['海南','福建','三亚','蜈支洲岛','海口','厦门','鼓浪屿','武夷山','泉州'],
   ['江苏','南京','苏州','无锡','扬州','周庄','常州','连云港','同里'],
   ['广东广西','广州','深圳','珠海','汕头','桂林','阳朔','北海','黄姚古镇'],
   ['西藏贵州','拉萨','林芝','阿里','黔东南','荔波','镇远','西江','黄果树'],
   ['西北','西安','青海湖','西宁','祁连','敦煌','兰州','甘南','张掖','嘉峪关','新疆'],
   ['山东山西','青岛','泰山','日照','威海','烟台','长岛','蓬莱','平遥','大同','五台山','壶口瀑布']
]

function Alist(){
	// 循环
	for(let i = 0; i < AArr.length; i++){

		// 定义新元素容器
      let div = document.createElement('div')
      // 容器结构左右结构 左边是字母 ，右边 是地名
      div.innerHTML = `
            <div></div>
            <ul>

            </ul>
      `;

      // 将定义的容器循环添加到付容器中
      AItem.appendChild(div)

      // 循环变量数组内容创建装有地区的节点
      for(let j = 1; j < AArr[i].length; j++){
         // 将字母循环放进左边容器
         div.children[0].innerHTML = AArr[i][0];
         // 右边创建新的节点li 装地区的节点
         let li = document.createElement('li');
         // 将节点添加进ul中
         div.children[1].appendChild(li)
         // 将地区名逐一放进li节点
         AItem.children[i].children[1].children[j-1].innerHTML = AArr[i][j];
      }
   }
}

Alist();