// 每个州的容器
var FItem = document.querySelector('.place .F');

const FArr = [
   ['美国','洛杉矶','旧金山','纽约','塞班岛','夏威夷','关岛','西雅图','华盛顿','波士顿','奥兰多','迈阿密','芝加哥','阿拉斯加'],
   ['英国','爱尔兰','伦敦','爱丁堡','剑桥','牛津','约克','都柏林'],
   ['意大利','罗马','威尼斯','佛罗伦萨','米兰','五渔村'],
   ['法国','瑞士','巴黎','普罗旺斯','卢塞恩','苏黎世','因特拉肯','日内瓦'],
   ['西班牙','巴塞罗那','马德里','塞维利亚','格拉纳达','托莱多'],
   ['德国','奥地利','慕尼黑','法兰克福','柏林','科隆','福森','维也纳','哈尔施塔特','萨尔茨堡'],
   ['冰岛','圣托里尼','雅典','伊斯坦布尔','棉花堡','卡帕多奇亚'],
   ['荷兰','比利时','阿姆斯特丹','鹿特丹','羊角村','布鲁塞尔','布鲁日'],
   ['美洲其他','加拿大','巴西','古巴','墨西哥','秘鲁'],
   ['欧洲其他','芬兰','挪威','丹麦','瑞典','塞尔维亚','克罗地亚']
]

function Flist(){
	// 循环
	for(let i = 0; i < FArr.length; i++){

		// 定义新元素容器
      let div = document.createElement('div')
      // 容器结构左右结构 左边是字母 ，右边 是地名
      div.innerHTML = `
            <div></div>
            <ul>

            </ul>
      `;

      // 将定义的容器循环添加到付容器中
      FItem.appendChild(div)

      // 循环变量数组内容创建装有地区的节点
      for(let j = 1; j < FArr[i].length; j++){
         // 将字母循环放进左边容器
         div.children[0].innerHTML = FArr[i][0];
         // 右边创建新的节点li 装地区的节点
         let li = document.createElement('li');
         // 将节点添加进ul中
         div.children[1].appendChild(li)
         // 将地区名逐一放进li节点
         FItem.children[i].children[1].children[j-1].innerHTML = FArr[i][j];
      }
   }
}

Flist();